# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'contentful-cli'
brew 'gh'
brew 'git'
brew 'git-flow'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
brew 'composer'
# brew 'imagemagick' <- if installing, also install 'pkg-config'
# brew 'mysql'
brew 'nginx'
brew 'node'
brew 'postgresql'
# brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
# cask 'caffeine'
cask 'dash'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive'
# cask 'gpg-suite'
cask 'graphql-playground'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'keybase'
cask 'obsidian'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
